SpenceKonde/ATTinyCore/avr/boards.txt
# Overhauled summer 2015 by Dr. Azzy (Spence Konde) and again in early 2016 to add support for more chips.
# Significant overhaul again in summer 2020 for micronucleus boards.

menu.chip=Chip
menu.clock=Clock
menu.sketchclock=Clock (controls sketch only)
menu.bod=B.O.D. Level (Only set on ISP bootload)
menu.bodact=B.O.D. Mode (active)
menu.bodpd=B.O.D. Mode (sleep)
menu.eesave=Save EEPROM
menu.pinmapping=Pin Mapping
menu.INITIALIZE_SECONDARY_TIMERS=Initialize Secondary Timers
menu.TimerClockSource=Timer 1 Clock
menu.LTO=LTO (1.6.11+ only)
menu.bootUART=Bootloader UART
menu.wiremode=Wire Modes
menu.neopixelport=tinyNeoPixel port
menu.millis=millis()/micros()
menu.burnmode=Burn Bootloader Mode
menu.resetpin=Reset Pin (Only set on ISP bootload)





attinyx8micr.name=ATtiny88 (Micronucleus, MH-ET TIMING DEV TEST)
attinyx8micr.upload.tool=micronucleus
attinyx8micr.upload.protocol=usb
attinyx8micr.build.board=AVR_ATTINYX8
attinyx8micr.bootloader.tool=avrdude
attinyx8micr.bootloader.unlock_bits=0xFF
attinyx8micr.bootloader.lock_bits=0xFF
attinyx8micr.build.core=tiny
attinyx8micr.build.export_merged_output=false
attinyx8micr.menu.LTO.enable=Enabled
attinyx8micr.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx8micr.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx8micr.menu.LTO.enable.ltocppflags=-flto
attinyx8micr.menu.LTO.enable.ltoarcmd=gcc-
attinyx8micr.menu.LTO.disable=Disabled
attinyx8micr.menu.LTO.disable.ltocflags=
attinyx8micr.menu.LTO.disable.ltoelfflags=
attinyx8micr.menu.LTO.disable.ltocppflags=
attinyx8micr.menu.LTO.disable.ltoarcmd=
attinyx8micr.bootloader.low_fuses=0xE1
attinyx8micr.build.mcu=attiny88
attinyx8micr.build.usb=
attinyx8micr.upload.maximum_size=6650
attinyx8micr.upload.maximum_data_size=512
attinyx8micr.menu.sketchclock.20external=20 MHz (DEV TEST)
attinyx8micr.menu.sketchclock.20external.build.f_cpu=20000000L
attinyx8micr.menu.sketchclock.20external.build.clocksource=2
attinyx8micr.menu.sketchclock.165external=16.5 MHz (DEV TEST)
attinyx8micr.menu.sketchclock.165external.build.f_cpu=16500000L
attinyx8micr.menu.sketchclock.165external.build.clocksource=2
attinyx8micr.menu.sketchclock.16external=16 MHz (DEV TEST)
attinyx8micr.menu.sketchclock.16external.build.f_cpu=16000000L
attinyx8micr.menu.sketchclock.16external.build.clocksource=2
attinyx8micr.menu.sketchclock.128external=12.8 MHz (DEV TEST)
attinyx8micr.menu.sketchclock.128external.build.f_cpu=12800000L
attinyx8micr.menu.sketchclock.128external.build.clocksource=2
attinyx8micr.menu.sketchclock.12external=12 MHz (DEV TEST)
attinyx8micr.menu.sketchclock.12external.build.f_cpu=12000000L
attinyx8micr.menu.sketchclock.12external.build.clocksource=2
attinyx8micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx8micr.bootloader.extended_fuses=0xfe
attinyx8micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx8micr.menu.bod.2v7.bootloader.bod_bits=101
attinyx8micr.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx8micr.menu.bod.disable.bootloader.bod_bits=111
attinyx8micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8micr.menu.bod.4v3.bootloader.bod_bits=100
attinyx8micr.menu.resetpin.reset=Reset
attinyx8micr.menu.resetpin.reset.bootloader.rstbit=1
attinyx8micr.menu.resetpin.gpio=GPIO (Danger - disables ISP)
attinyx8micr.menu.resetpin.gpio.bootloader.rstbit=0
attinyx8micr.menu.burnmode.upgrade=Upgrade (via USB, fuses unchanged)
attinyx8micr.menu.burnmode.upgrade.bootloader.file=micronucleus/upgrade-t88_entry_on_power_on_no_pullup_fast_exit_on_no_USB.hex
attinyx8micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attinyx8micr.menu.burnmode.install=Fresh Install (via ISP, set fuses)
attinyx8micr.menu.burnmode.install.bootloader.file=micronucleus/t88_entry_on_power_on_no_pullup_fast_exit_on_no_USB.hex
attinyx8micr.menu.burnmode.install.bootloader.tool=avrdude
attinyx8micr.build.variant=tinyX8
attinyx8micr.menu.millis.enabled=Enabled
attinyx8micr.menu.millis.disabled=Disabled (saves flash)
attinyx8micr.menu.millis.enabled.build.millis=
attinyx8micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx8micr.menu.neopixelport.porta=Port A (pins 23~26)
attinyx8micr.menu.neopixelport.portb=Port B (pins 16~22,27)
attinyx8micr.menu.neopixelport.portc=Port C (pins 9~13)
attinyx8micr.menu.neopixelport.portd=Port D (pins 0~7)
attinyx8micr.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx8micr.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx8micr.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=PORTC
attinyx8micr.menu.neopixelport.portd.build.neopixelport=-DNEOPIXELPORT=PORTD
attinyx8micr.build.extra_flags={build.millis} {build.usb} {build.neopixelport}
